{"questions":[{"id":"9aa8c0c0-15e9-4891-9f23-964891d7ec72","Question":"What is the primary goal of applying agile principles in data science projects?","Type":1,"A":"The primary goal is to enable flexibility, collaboration, and iterative progress throughout the entire data science lifecycle","B":"Agile principles in data science aim to expedite project timelines and deliver results quickly, despite sacrificing collaboration and flexibility.","C":"Applying agile principles in data science projects primarily aims to establish a rigid and fixed project plan, ensuring that every step is carefully predetermined to avoid any deviations.","D":"Agile decision-making in data science aims to reduce communication and collaboration, enabling team members to work independently and complete tasks without unnecessary interactions.","True":"B","TopicID":1},{"id":"0e43af2c-ea5f-48ad-bea5-4708f06586a5","Question":"Agile integrates --------------- from users, ensuring that the final solution aligns closely with user needs and expectations.","Type":2,"A":"occasional opinions","B":"regular feedback","C":"limited feedback","D":"final feedback","True":"B","TopicID":2},{"id":"8fc834f5-ad97-4789-98f3-f06266fb3b79","Question":"In agile data science, cross-functional collaboration emphasized to ---------- , fostering a multidisciplinary approach to problem-solving.","Type":2,"A":"enforce strict hierarchies","B":"achieve successful outcomes without the need for interdisciplinary cooperation.","C":"bring together diverse expertise","D":"encourage team members to build friendships","True":"C","TopicID":2},{"id":"9ee7211c-435f-4b8c-819f-4c05651175aa","Question":"What role does rapid prototyping play in agile data science projects?","Type":1,"A":"it is merely a time-consuming process that delays project completion, as stakeholders have to wait for preliminary results before any progress can be made.","B":"it is to create a final, polished version of the solution, eliminating the need for further adjustments or iterations.","C":"it is an optional step and doesn't significantly contribute to the project's success, as stakeholders can understand the solution without visualizing preliminary results.","D":"it allows stakeholders to visualize and interact with preliminary results quickly, facilitating early validation and adjustments as needed.","True":"D","TopicID":1},{"id":"dc022f58-111f-47af-b38c-d94fdd1a5bb2","Question":"How does agile decision-making address the challenge of changing project requirements in data science?","Type":1,"A":"it ignores changing project requirements and follows a rigid plan, assuming that the initial specifications are always accurate and should not be altered.","B":"exacerbates the challenge of changing project requirements by introducing unnecessary complexity, making it difficult for teams to respond effectively to evolving needs.","C":"it prioritizes adaptability to changing requirements, encouraging teams to adjust their approach based on new insights or evolving priorities.","D":"is focused solely on adhering to the original project requirements, disregarding any need for adjustments or flexibility in response to changing circumstances.","True":"C","TopicID":1},{"id":"c7aa9508-6716-4a44-9bec-8092ca2f15f4","Question":"Why is continuous integration and deployment important in agile data science?","Type":1,"A":"they are unnecessary, as it is more efficient to complete all tasks before integration to avoid disruptions.","B":"they ensure that new features or improvements are integrated frequently, keeping the project in a state of readiness at all times.","C":"primarily aim to slow down the development process, making it harder for teams to manage project timelines effectively.","D":"they are essential in agile data science to create a fixed and unchanging project environment, preventing the incorporation of new features or improvements.","True":"B","TopicID":1},{"id":"0bfbd5f4-838f-44a4-a0b3-1a307060fb28","Question":"What are the benefits of transparent communication in agile data science projects?","Type":1,"A":"Transparent communication, through regular meetings and documentation, helps keep team members informed and aligned with project goals, reducing misunderstandings.","B":"It is irrelevant, as individual team members should work independently without the need for collaboration or updates.","C":"It is to create unnecessary bureaucracy, slowing down the project by requiring excessive documentation and meetings.","D":"It is optional, and teams can achieve success without sharing information openly, fostering a more individualistic work culture.","True":"A","TopicID":1},{"id":"6cf90b29-9fd5-46e3-8738-fa0d0383be7f","Question":"How does agile decision-making in data science contribute to risk mitigation?","Type":1,"A":"It increases project risks by encouraging frequent changes, making it challenging to maintain a stable and predictable project environment.","B":"It has no impact on risk mitigation, as it primarily focuses on speed and ignores potential challenges that may arise during the project.","C":"is unnecessary, and agile decision-making exacerbates risks by promoting a hasty approach without thorough consideration of potential issues.","D":"Agile involves identifying and addressing risks early in the process, minimizing the impact of unforeseen challenges on project timelines and outcomes.","True":"D","TopicID":1}]}