{"activeTopics":[{"id":"bbd769a4-dc6f-4c13-a737-7937bb96a1e1","topicID":1}],"topics":[{"id":"51835449-2a25-47d1-95ff-a82bb92691c4","TopicID":1,"TopicName":"Lean Origin","Description":"Lean is a management philosophy and methodology focused on maximizing value and minimizing waste in processes.\r\n\r\nOriginating from manufacturing principles developed by Toyota, it has since been applied to various industries. Lean emphasizes continuous improvement, respect for people, and delivering customer value through efficient and streamlined processes.\r\n\r\nKey principals include identifying and eliminating waste, empowering employees to contribute to improvement and fostering a culture of continuous Leaning and adaptability. Lean tools and practices, such as kanban and 5s, are commonly used to optimize workflows and enhance overall organizational effeciency\r\n\r\nLean Software Development\r\n\r\nA holistic approach optimizing software development processes for efficiency and value delivery: \r\n\r\n1- Value Stream Mapping (VSM)\r\n\r\n2- Just in Time (JIT)\r\n\r\n3- Kaizen (Continuous Improvement)\r\n\r\n4- 5S System\r\n\r\n5- Kanban System\r\n\r\n6- Poka-Yoke (Error Proofing)\r\n\r\n7- Heijunka (Production Leveling)\r\n\r\n8- Standard Work\r\n\r\n9- Total Productive Maintenance (TPM)\r\n\r\n10- Respect for People"},{"id":"83bd075d-c985-46f8-89e7-6d266f3a5892","TopicID":2,"TopicName":"Agile Decision-Making in Data Science","Description":"Agile methodology is a project management framework that emphasizes flexibility, collaboration, and iterative development. It was originally developed for software development projects but can be applied to data science projects as well . Agile principles and values can help data science teams to be more responsive to changing requirements, deliver working software frequently, and collaborate effectively with business stakeholders . \r\nAgile decision-making in data science involves a series of tasks that are conceived, executed, and adapted as the situation demands. The focus is not on what to do, but how to think. Agile values and places priority on individuals and interactions, working software, and customer satisfaction through early and continuous software delivery . \r\nIn summary, Agile methodology can be applied to data science projects to help teams be more responsive to changing requirements, deliver working software frequently, and collaborate effectively with business stakeholders. Agile decision-making in data science involves a series of tasks that are conceived, executed, and adapted as the situation demands, with a focus on individuals and interactions, working software, and customer satisfaction ."},{"id":"1a9642c6-77db-48b9-9f91-7472c85a5630","TopicID":3,"TopicName":"Lean Integration in Data Projects","Description":"Lean Integration in Data Projects is a form of process engineering that focuses on creating value for customers, reducing waste, and prioritizing long-term thinking. It uses the principles of Lean, an efficiency methodology that was initially developed for manufacturing. Lean integration is a hands-on management system that guides day-to-day decision-making, as well as a long-term strategy. In the context of data projects, the “customer” can be anyone who benefits from the end result of the project, whether that’s an internal user, a project sponsor, or an external customer that will interact directly with the system. In all instances, lean integration follows seven principles:\r\n1) Eliminate Waste, \r\n2) Automate Processes, \r\n3) Empower the Team, \r\n4) Continuously Improve, \r\n5) Build Quality In, \r\n6) Plan for Change, and \r\n7) Deliver Value to the Customer. \r\nLean integration is a data-driven methodology that relies on continuous improvement and elimination of waste to maximize customer value."},{"id":"f6d2af2c-3dc4-49e2-91d0-2d18e0d069d6","TopicID":4,"TopicName":"Data-Driven Innovation","Description":"Data-Driven Innovation is the use of data and analytics to develop or foster new products, processes, organizational methods, and markets. It is a formal innovation process paradigm that focuses on creating value through the use of data and analytics. Data-driven innovation is often confused with several other data-related phenomena, but it is formally defined as a process-based taxonomy of different data-driven innovation approaches. The future of innovation processes is anticipated to be more data-driven and empowered by the ubiquitous digitalization, increasing data accessibility, and rapid advances in machine learning, artificial intelligence, and computing technologies. Data-driven innovation can drive both the discovery and execution of innovation, achieving new business models, products, and services with a confirmed business value."}],"questions":[{"id":"9fbecffd-91dc-42d3-8bf6-cb630fdfe89a","Question":"Where did Lean originate, and which manufacturing principles influenced its development?\r\nA: The primary focus of Lean philosophy and methodology is _____________________ value and minimizing waste in processes.","Type":2,"A":"on manimizing","B":"on maximizing","C":"on equalizing","D":"all","True":"B","TopicID":1},{"id":"346bc84e-69a4-454f-915e-2d7813f59e46","Question":"Where did Lean originate, and which manufacturing principles influenced its development?\r\nA: Lean originated from manufacturing principles developed by _____________________ .","Type":2,"A":"Hitach","B":"Suzuki","C":"Toyota","D":"Google","True":"C","TopicID":1},{"id":"6b02296b-df63-4d3c-a06b-17e9f4e5e431","Question":"Name one key emphasis of Lean in addition to continuous improvement.","Type":1,"A":"Respect for people is highlighted as a key emphasis of Lean in addition to static improvement","B":"Respect for Things is highlighted as a key emphasis of Keys in addition to continuous improvement","C":"Respect for people is highlighted as a key emphasis of Life in addition to continuous improvement","D":"Respect for people is highlighted as a key emphasis of Lean in addition to continuous improvement","True":"D","TopicID":1},{"id":"c92bb299-90bc-485e-ae01-e18406dbf7f6","Question":"What are the core principles of Lean, as mentioned in the text?","Type":1,"A":"The core principles of Lean include identifying and eliminating waste, empowering employees for improvement, and fostering a culture of continuous Leaning and adaptability.","B":"The core principles of Lean include identifying and eliminating waste, empowering employees for improvement, and fostering a culture of continuous Leaning and adaptability.","C":"The core principles of Lean include identifying and eliminating waste, empowering languages/IDE for improvement, and fostering a culture of continuous Leaning and adaptability.","D":"All","True":"A","TopicID":1},{"id":"21470c3d-d32f-4fd0-a757-53d1b3c68d16","Question":"How does Lean aim to deliver value to customers?","Type":1,"A":"Lean aims to deliver customer value through efficient and streamlined processes.","B":"Lean aims to have customer value through not efficient and streamlined processes.","C":"Lean aims to take developers value through efficient and life processes.","D":"All","True":"A","TopicID":1},{"id":"24470b7f-2864-45a5-a8db-4a62f6df485b","Question":"What role do employees play in Lean, according to the text?","Type":1,"A":"Employees are empowered to contribute to improvement in Lean","B":"Employees are not empowered to contribute to improvement in Lean","C":"Employees are empowered to contribute to improvement in Life","D":"Employees are empowered to contribute to improvement in IDE","True":"A","TopicID":1},{"id":"05948128-fee1-4a78-9b89-6440f48131c0","Question":"Can you mention one Lean tool or practice used for optimizing workflows?\r\nA: _____________________ and 5S are mentioned as Lean tools and practices used for optimizing","Type":2,"A":"C# for developers","B":"Kanban","C":"Joomula","D":"Bootstrap","True":"B","TopicID":1},{"id":"500ecbc2-fe97-408e-8ad6-c38ea35b91fd","Question":"Which two principles does Lean prioritize for organizational efficiency?","Type":1,"A":"Lean prioritizes continuous improvement and respect for people for organizational efficiency.","B":"Lean prioritizes statics improvement and respect for people for organizational efficiency.","C":"Lean prioritizes continuous improvement and not respect for people for organizational efficiency.","D":"None","True":"A","TopicID":1},{"id":"99135c47-93f4-4d42-acdf-ee3dba1b2825","Question":"How does Lean foster a culture of continuous Leaning and adaptability?","Type":1,"A":"Lean fosters a culture of continuous Leaning and adaptability by empowering languages and encouraging improvement.","B":"Lean fosters a culture of continuous Leaning and static by empowering employees and encouraging improvement.","C":"Lean fosters a culture of life Leaning and adaptability by empowering employees and encouraging improvement.","D":"None","True":"D"},{"id":"58db49bd-4b46-48d4-a809-0b4ad0ebdfe2","Question":"What industries has Lean been applied to since its origin in manufacturing?","Type":1,"A":"Lean has been removed to various industries since its origin in manufacturing.","B":"Lean has been applied to only one industry since its origin in manufacturing.","C":"Lean has been applied to various industries since its origin in manufacturing.","D":"Lean has been applied to various industries since its origin in google.","True":"C"},{"id":"e5899ad5-dc93-4149-81e6-48b865d751d9","Question":"What is the primary goal of applying agile principles in data science projects?","Type":1,"A":"The primary goal is to enable flexibility, collaboration, and iterative progress throughout the entire data science lifecycle","B":"Agile principles in data science aim to expedite project timelines and deliver results quickly, despite sacrificing collaboration and flexibility.","C":"Applying agile principles in data science projects primarily aims to establish a rigid and fixed project plan, ensuring that every step is carefully predetermined to avoid any deviations.","D":"Agile decision-making in data science aims to reduce communication and collaboration, enabling team members to work independently and complete tasks without unnecessary interactions.","True":"B","TopicID":1},{"id":"96b023f8-ade2-42d3-b27c-bac755c2c08f","Question":"Agile integrates --------------- from users, ensuring that the final solution aligns closely with user needs and expectations.","Type":2,"A":"occasional opinions","B":"regular feedback","C":"limited feedback","D":"final feedback","True":"B","TopicID":2},{"id":"93919e0f-6f41-4e97-bc2a-73f21cf4b907","Question":"In agile data science, cross-functional collaboration emphasized to ---------- , fostering a multidisciplinary approach to problem-solving.","Type":2,"A":"enforce strict hierarchies","B":"achieve successful outcomes without the need for interdisciplinary cooperation.","C":"bring together diverse expertise","D":"encourage team members to build friendships","True":"C","TopicID":2},{"id":"9ada10c4-8bf3-459f-b225-18282d3bb364","Question":"What role does rapid prototyping play in agile data science projects?","Type":1,"A":"it is merely a time-consuming process that delays project completion, as stakeholders have to wait for preliminary results before any progress can be made.","B":"it is to create a final, polished version of the solution, eliminating the need for further adjustments or iterations.","C":"it is an optional step and doesn't significantly contribute to the project's success, as stakeholders can understand the solution without visualizing preliminary results.","D":"it allows stakeholders to visualize and interact with preliminary results quickly, facilitating early validation and adjustments as needed.","True":"D","TopicID":1},{"id":"4cb9f81f-2805-4b8f-85e1-6e76e007cd40","Question":"How does agile decision-making address the challenge of changing project requirements in data science?","Type":1,"A":"it ignores changing project requirements and follows a rigid plan, assuming that the initial specifications are always accurate and should not be altered.","B":"exacerbates the challenge of changing project requirements by introducing unnecessary complexity, making it difficult for teams to respond effectively to evolving needs.","C":"it prioritizes adaptability to changing requirements, encouraging teams to adjust their approach based on new insights or evolving priorities.","D":"is focused solely on adhering to the original project requirements, disregarding any need for adjustments or flexibility in response to changing circumstances.","True":"C","TopicID":1},{"id":"63eb8210-9771-4caf-97aa-883a048d911e","Question":"Why is continuous integration and deployment important in agile data science?","Type":1,"A":"they are unnecessary, as it is more efficient to complete all tasks before integration to avoid disruptions.","B":"they ensure that new features or improvements are integrated frequently, keeping the project in a state of readiness at all times.","C":"primarily aim to slow down the development process, making it harder for teams to manage project timelines effectively.","D":"they are essential in agile data science to create a fixed and unchanging project environment, preventing the incorporation of new features or improvements.","True":"B","TopicID":1},{"id":"6aa894d5-ef79-494c-8143-e7ded00ba6d5","Question":"What are the benefits of transparent communication in agile data science projects?","Type":1,"A":"Transparent communication, through regular meetings and documentation, helps keep team members informed and aligned with project goals, reducing misunderstandings.","B":"It is irrelevant, as individual team members should work independently without the need for collaboration or updates.","C":"It is to create unnecessary bureaucracy, slowing down the project by requiring excessive documentation and meetings.","D":"It is optional, and teams can achieve success without sharing information openly, fostering a more individualistic work culture.","True":"A","TopicID":1},{"id":"f560084a-8488-4c9d-920b-afe32dbbeebf","Question":"How does agile decision-making in data science contribute to risk mitigation?","Type":1,"A":"It increases project risks by encouraging frequent changes, making it challenging to maintain a stable and predictable project environment.","B":"It has no impact on risk mitigation, as it primarily focuses on speed and ignores potential challenges that may arise during the project.","C":"is unnecessary, and agile decision-making exacerbates risks by promoting a hasty approach without thorough consideration of potential issues.","D":"Agile involves identifying and addressing risks early in the process, minimizing the impact of unforeseen challenges on project timelines and outcomes.","True":"D","TopicID":1},{"id":"8546367d-5102-4e5f-be39-61ce3f7467f0","Question":"What is the primary goal of Lean Integration in Data Projects?","Type":1,"A":"The main goal of Lean Integration is to prioritize complex and time-consuming data integration steps to ensure comprehensive coverage.","B":": Lean Integration primarily focuses on increasing data storage capacity to accommodate a wide range of datasets without considering efficiency.","C":"The core objective of Lean Integration is to introduce unnecessary steps to enhance the complexity of data integration processes","D":"The primary goal of Lean Integration in Data Projects is to eliminate waste and improve efficiency in data integration processes","True":"D","TopicID":3},{"id":"b37f34a5-c965-4d30-af7c-52ece923acb5","Question":"How does Lean Integration contribute to customer-centric data projects?","Type":1,"A":"Lean Integration contributes to customer-centric data projects by prioritizing the integration of data that directly meets user needs and business objectives.","B":"Lean Integration neglects customer needs, emphasizing only technical aspects and efficiency without considering the value delivered to end-users.","C":"Customer-centricity in Lean Integration is achieved by adding unnecessary features and complexities to data integration processes.","D":"Lean Integration aims to minimize customer involvement in data projects, relying solely on technical decisions without considering user requirements.","True":"A","TopicID":3},{"id":"6cbc1721-ce9d-44a3-87f1-8fe6630ad517","Question":"Which principle does Lean Integration follow to adapt to changing business requirements?","Type":3,"A":"Rigidity and resistance to change","B":"Continuous Improvement","C":"Static integration processes","D":"Delayed response to technological advancements","True":"B","TopicID":3},{"id":"810a0d0a-7ffc-4f37-95cc-7b3c8cdb6ab3","Question":"What is the benefit of adopting a pull-based system in Lean Integration?","Type":1,"A":"Maximizing unnecessary processing and storage of data","B":"Minimizing unnecessary processing and storage of data","C":"Ignoring actual demand for data integration","D":"Delaying data integration based on demand","True":"B","TopicID":3},{"id":"b5896819-bdfb-4520-937c-3c6623d16bf5","Question":"cross-functional collaboration is emphasized in Lean Integration _______________.","Type":2,"A":"To create unnecessary conflicts within teams","B":"To hinder the alignment of integration efforts with business goals","C":"To ensure integration efforts align with overall business goals","D":"To delay the completion of data projects","True":"C","TopicID":3},{"id":"5f45aba1-9b9a-41f6-b32d-de5a2f92d6de","Question":"What role does visual management play in Lean Integration?","Type":1,"A":"Complicating data integration processes","B":"Hindering transparency and understanding across the organization","C":"Helping teams monitor and manage data integration processes more effectively","D":"Minimizing the use of visual tools in data projects","True":"C","TopicID":3},{"id":"4ea7e9eb-56d1-4ec1-b3e7-73f2a99da2e5","Question":"In what type of landscape is Lean Integration particularly valuable?(select the correct one)","Type":3,"A":"Slow and unchanging","B":"Dynamic and fast-paced","C":"Static and predictable","D":"Resistant to technological advancements","True":"B","TopicID":3},{"id":"341e4a5a-7c49-4912-8614-889615e7841a","Question":"Lean Integration advocate for in terms of iteration and prototyping to _________________.","Type":2,"A":"Delaying iterations and avoiding prototypes","B":"Quick iterations and the development of prototypes","C":"Ignoring the need for validation in integration approaches","D":"Emphasizing suboptimal solutions in data projects","True":"B","TopicID":3},{"id":"8950d454-f180-442b-a40a-cd11488800f5","Question":"How does Lean Integration handle data integration based on demand?(Select the true one)","Type":3,"A":"Push-Based System","B":"Delayed Integration","C":"Pull-Based System","D":"Static Integration","True":"C","TopicID":3},{"id":"5ed0e658-a03c-4f2c-89e3-72326e2dad85","Question":"In Agile methodology, what is the primary focus of continuous learning?","Type":1,"A":"Strict adherence to plans","B":"Ongoing skill development","C":"Rigid process documentation","D":"Fixed project requirements","True":"B","TopicID":4},{"id":"773e94c7-34f0-4296-bcc9-b76f2e40f0e1","Question":"_____________ is the purpose of a Sprint Backlog in Scrum?","Type":2,"A":"Define long-term project goals","B":"Document historical team achievements","C":"Plan tasks for a specific sprint","D":"Capture customer feedback","True":"C","TopicID":4},{"id":"71414b4a-7126-4d11-9416-88dee38f5beb","Question":"What role does customer feedback play in Agile development?","Type":1,"A":"Irrelevant to the development process","B":"Used only after project completion","C":"Validates assumptions and guides development","D":"Affects project timelines only","True":"C","TopicID":4},{"id":"94b211c9-8cf2-49f3-9b43-c79c0c8f0d5d","Question":"In data-driven innovation, A/B testing involves _______________","Type":2,"A":"Assessing team performance","B":"Comparing two versions of a product or feature","C":"Allocating budget for development","D":"Analyzing project documentation","True":"B","TopicID":4},{"id":"59fb0f30-dc10-4090-89cd-778e2339aa97","Question":"What is the primary benefit of visual management tools in Agile?","Type":1,"A":"Increase project complexity","B":"Provide real-time insights and transparency","C":"Decrease collaboration among team members","D":"Replace human interactions","True":"B","TopicID":4},{"id":"1ca35b9e-b8cd-4600-8312-28ece1b425b8","Question":"What does the term \"Lean\" in Agile refer to?","Type":1,"A":"Lengthening project timelines","B":"Adding unnecessary features","C":"Minimizing waste and maximizing value","D":"Ignoring customer feedback","True":"C","TopicID":4},{"id":"9b75a747-6037-4f39-988e-148a0dcb17b5","Question":"How does predictive analytics contribute to Agile methodologies.","Type":1,"A":"Increases uncertainty","B":"Isolates teams from external factors","C":"Slows down the development process","D":"Identifies trends and forecasts outcomes","True":"D","TopicID":4},{"id":"188b94c3-fcff-47df-820d-204228a565be","Question":"In Agile, what is the purpose of the Daily Standup (Scrum) or Daily Huddle?","Type":1,"A":"Discuss personal matters","B":"Review long-term project goals","C":"Share progress, plans, and impediments","D":"Eliminate team collaboration","True":"C","TopicID":4},{"id":"1ce5839e-dfe4-4a86-9a57-cffe5c86edb5","Question":"What role does experimentation play in Agile development?","Type":1,"A":"Validates ideas through testing","B":"Hinders progress","C":"Delays project delivery","D":"Ignores customer preferences","True":"A","TopicID":4}],"responses":[{"id":"669e3c71-8b5e-4815-a18c-aba092ea9ff1","idActiveTopic":"1","myActiveTopics":[{"id":"bbd769a4-dc6f-4c13-a737-7937bb96a1e1","topicID":1}],"player":"Lourenco.Carlos@gmail.com","myQuestions":[{"id":"4cb9f81f-2805-4b8f-85e1-6e76e007cd40","Question":"How does agile decision-making address the challenge of changing project requirements in data science?","Type":1,"A":"it ignores changing project requirements and follows a rigid plan, assuming that the initial specifications are always accurate and should not be altered.","B":"exacerbates the challenge of changing project requirements by introducing unnecessary complexity, making it difficult for teams to respond effectively to evolving needs.","C":"it prioritizes adaptability to changing requirements, encouraging teams to adjust their approach based on new insights or evolving priorities.","D":"is focused solely on adhering to the original project requirements, disregarding any need for adjustments or flexibility in response to changing circumstances.","True":"C","TopicID":1,"result":"B"},{"id":"6aa894d5-ef79-494c-8143-e7ded00ba6d5","Question":"What are the benefits of transparent communication in agile data science projects?","Type":1,"A":"Transparent communication, through regular meetings and documentation, helps keep team members informed and aligned with project goals, reducing misunderstandings.","B":"It is irrelevant, as individual team members should work independently without the need for collaboration or updates.","C":"It is to create unnecessary bureaucracy, slowing down the project by requiring excessive documentation and meetings.","D":"It is optional, and teams can achieve success without sharing information openly, fostering a more individualistic work culture.","True":"A","TopicID":1,"result":"C"},{"id":"05948128-fee1-4a78-9b89-6440f48131c0","Question":"Can you mention one Lean tool or practice used for optimizing workflows?\r\nA: _____________________ and 5S are mentioned as Lean tools and practices used for optimizing","Type":2,"A":"C# for developers","B":"Kanban","C":"Joomula","D":"Bootstrap","True":"B","TopicID":1,"result":"A"},{"id":"e5899ad5-dc93-4149-81e6-48b865d751d9","Question":"What is the primary goal of applying agile principles in data science projects?","Type":1,"A":"The primary goal is to enable flexibility, collaboration, and iterative progress throughout the entire data science lifecycle","B":"Agile principles in data science aim to expedite project timelines and deliver results quickly, despite sacrificing collaboration and flexibility.","C":"Applying agile principles in data science projects primarily aims to establish a rigid and fixed project plan, ensuring that every step is carefully predetermined to avoid any deviations.","D":"Agile decision-making in data science aims to reduce communication and collaboration, enabling team members to work independently and complete tasks without unnecessary interactions.","True":"B","TopicID":1,"result":"C"},{"id":"500ecbc2-fe97-408e-8ad6-c38ea35b91fd","Question":"Which two principles does Lean prioritize for organizational efficiency?","Type":1,"A":"Lean prioritizes continuous improvement and respect for people for organizational efficiency.","B":"Lean prioritizes statics improvement and respect for people for organizational efficiency.","C":"Lean prioritizes continuous improvement and not respect for people for organizational efficiency.","D":"None","True":"A","TopicID":1,"result":"A"},{"id":"9ada10c4-8bf3-459f-b225-18282d3bb364","Question":"What role does rapid prototyping play in agile data science projects?","Type":1,"A":"it is merely a time-consuming process that delays project completion, as stakeholders have to wait for preliminary results before any progress can be made.","B":"it is to create a final, polished version of the solution, eliminating the need for further adjustments or iterations.","C":"it is an optional step and doesn't significantly contribute to the project's success, as stakeholders can understand the solution without visualizing preliminary results.","D":"it allows stakeholders to visualize and interact with preliminary results quickly, facilitating early validation and adjustments as needed.","True":"D","TopicID":1,"result":"A"},{"id":"9fbecffd-91dc-42d3-8bf6-cb630fdfe89a","Question":"Where did Lean originate, and which manufacturing principles influenced its development?\r\nA: The primary focus of Lean philosophy and methodology is _____________________ value and minimizing waste in processes.","Type":2,"A":"on manimizing","B":"on maximizing","C":"on equalizing","D":"all","True":"B","TopicID":1,"result":"B"},{"id":"6b02296b-df63-4d3c-a06b-17e9f4e5e431","Question":"Name one key emphasis of Lean in addition to continuous improvement.","Type":1,"A":"Respect for people is highlighted as a key emphasis of Lean in addition to static improvement","B":"Respect for Things is highlighted as a key emphasis of Keys in addition to continuous improvement","C":"Respect for people is highlighted as a key emphasis of Life in addition to continuous improvement","D":"Respect for people is highlighted as a key emphasis of Lean in addition to continuous improvement","True":"D","TopicID":1,"result":"A"},{"id":"21470c3d-d32f-4fd0-a757-53d1b3c68d16","Question":"How does Lean aim to deliver value to customers?","Type":1,"A":"Lean aims to deliver customer value through efficient and streamlined processes.","B":"Lean aims to have customer value through not efficient and streamlined processes.","C":"Lean aims to take developers value through efficient and life processes.","D":"All","True":"A","TopicID":1,"result":"A"},{"id":"346bc84e-69a4-454f-915e-2d7813f59e46","Question":"Where did Lean originate, and which manufacturing principles influenced its development?\r\nA: Lean originated from manufacturing principles developed by _____________________ .","Type":2,"A":"Hitach","B":"Suzuki","C":"Toyota","D":"Google","True":"C","TopicID":1,"result":"B"},{"id":"24470b7f-2864-45a5-a8db-4a62f6df485b","Question":"What role do employees play in Lean, according to the text?","Type":1,"A":"Employees are empowered to contribute to improvement in Lean","B":"Employees are not empowered to contribute to improvement in Lean","C":"Employees are empowered to contribute to improvement in Life","D":"Employees are empowered to contribute to improvement in IDE","True":"A","TopicID":1,"result":"B"},{"id":"c92bb299-90bc-485e-ae01-e18406dbf7f6","Question":"What are the core principles of Lean, as mentioned in the text?","Type":1,"A":"The core principles of Lean include identifying and eliminating waste, empowering employees for improvement, and fostering a culture of continuous Leaning and adaptability.","B":"The core principles of Lean include identifying and eliminating waste, empowering employees for improvement, and fostering a culture of continuous Leaning and adaptability.","C":"The core principles of Lean include identifying and eliminating waste, empowering languages/IDE for improvement, and fostering a culture of continuous Leaning and adaptability.","D":"All","True":"A","TopicID":1,"result":"C"},{"id":"f560084a-8488-4c9d-920b-afe32dbbeebf","Question":"How does agile decision-making in data science contribute to risk mitigation?","Type":1,"A":"It increases project risks by encouraging frequent changes, making it challenging to maintain a stable and predictable project environment.","B":"It has no impact on risk mitigation, as it primarily focuses on speed and ignores potential challenges that may arise during the project.","C":"is unnecessary, and agile decision-making exacerbates risks by promoting a hasty approach without thorough consideration of potential issues.","D":"Agile involves identifying and addressing risks early in the process, minimizing the impact of unforeseen challenges on project timelines and outcomes.","True":"D","TopicID":1,"result":"C"},{"id":"63eb8210-9771-4caf-97aa-883a048d911e","Question":"Why is continuous integration and deployment important in agile data science?","Type":1,"A":"they are unnecessary, as it is more efficient to complete all tasks before integration to avoid disruptions.","B":"they ensure that new features or improvements are integrated frequently, keeping the project in a state of readiness at all times.","C":"primarily aim to slow down the development process, making it harder for teams to manage project timelines effectively.","D":"they are essential in agile data science to create a fixed and unchanging project environment, preventing the incorporation of new features or improvements.","True":"B","TopicID":1,"result":"D"}]},{"id":"1d618d05-02ac-4de4-ba28-884e41add848","idActiveTopic":"1","myActiveTopics":[{"id":"bbd769a4-dc6f-4c13-a737-7937bb96a1e1","topicID":1}],"player":"Marta.Gomes@gmail.com","myQuestions":[{"id":"63eb8210-9771-4caf-97aa-883a048d911e","Question":"Why is continuous integration and deployment important in agile data science?","Type":1,"A":"they are unnecessary, as it is more efficient to complete all tasks before integration to avoid disruptions.","B":"they ensure that new features or improvements are integrated frequently, keeping the project in a state of readiness at all times.","C":"primarily aim to slow down the development process, making it harder for teams to manage project timelines effectively.","D":"they are essential in agile data science to create a fixed and unchanging project environment, preventing the incorporation of new features or improvements.","True":"B","TopicID":1,"result":"B"},{"id":"9fbecffd-91dc-42d3-8bf6-cb630fdfe89a","Question":"Where did Lean originate, and which manufacturing principles influenced its development?\r\nA: The primary focus of Lean philosophy and methodology is _____________________ value and minimizing waste in processes.","Type":2,"A":"on manimizing","B":"on maximizing","C":"on equalizing","D":"all","True":"B","TopicID":1,"result":"A"},{"id":"4cb9f81f-2805-4b8f-85e1-6e76e007cd40","Question":"How does agile decision-making address the challenge of changing project requirements in data science?","Type":1,"A":"it ignores changing project requirements and follows a rigid plan, assuming that the initial specifications are always accurate and should not be altered.","B":"exacerbates the challenge of changing project requirements by introducing unnecessary complexity, making it difficult for teams to respond effectively to evolving needs.","C":"it prioritizes adaptability to changing requirements, encouraging teams to adjust their approach based on new insights or evolving priorities.","D":"is focused solely on adhering to the original project requirements, disregarding any need for adjustments or flexibility in response to changing circumstances.","True":"C","TopicID":1,"result":"D"},{"id":"f560084a-8488-4c9d-920b-afe32dbbeebf","Question":"How does agile decision-making in data science contribute to risk mitigation?","Type":1,"A":"It increases project risks by encouraging frequent changes, making it challenging to maintain a stable and predictable project environment.","B":"It has no impact on risk mitigation, as it primarily focuses on speed and ignores potential challenges that may arise during the project.","C":"is unnecessary, and agile decision-making exacerbates risks by promoting a hasty approach without thorough consideration of potential issues.","D":"Agile involves identifying and addressing risks early in the process, minimizing the impact of unforeseen challenges on project timelines and outcomes.","True":"D","TopicID":1,"result":"B"},{"id":"c92bb299-90bc-485e-ae01-e18406dbf7f6","Question":"What are the core principles of Lean, as mentioned in the text?","Type":1,"A":"The core principles of Lean include identifying and eliminating waste, empowering employees for improvement, and fostering a culture of continuous Leaning and adaptability.","B":"The core principles of Lean include identifying and eliminating waste, empowering employees for improvement, and fostering a culture of continuous Leaning and adaptability.","C":"The core principles of Lean include identifying and eliminating waste, empowering languages/IDE for improvement, and fostering a culture of continuous Leaning and adaptability.","D":"All","True":"A","TopicID":1,"result":"B"},{"id":"24470b7f-2864-45a5-a8db-4a62f6df485b","Question":"What role do employees play in Lean, according to the text?","Type":1,"A":"Employees are empowered to contribute to improvement in Lean","B":"Employees are not empowered to contribute to improvement in Lean","C":"Employees are empowered to contribute to improvement in Life","D":"Employees are empowered to contribute to improvement in IDE","True":"A","TopicID":1,"result":"B"},{"id":"05948128-fee1-4a78-9b89-6440f48131c0","Question":"Can you mention one Lean tool or practice used for optimizing workflows?\r\nA: _____________________ and 5S are mentioned as Lean tools and practices used for optimizing","Type":2,"A":"C# for developers","B":"Kanban","C":"Joomula","D":"Bootstrap","True":"B","TopicID":1,"result":"D"},{"id":"e5899ad5-dc93-4149-81e6-48b865d751d9","Question":"What is the primary goal of applying agile principles in data science projects?","Type":1,"A":"The primary goal is to enable flexibility, collaboration, and iterative progress throughout the entire data science lifecycle","B":"Agile principles in data science aim to expedite project timelines and deliver results quickly, despite sacrificing collaboration and flexibility.","C":"Applying agile principles in data science projects primarily aims to establish a rigid and fixed project plan, ensuring that every step is carefully predetermined to avoid any deviations.","D":"Agile decision-making in data science aims to reduce communication and collaboration, enabling team members to work independently and complete tasks without unnecessary interactions.","True":"B","TopicID":1,"result":"B"},{"id":"6aa894d5-ef79-494c-8143-e7ded00ba6d5","Question":"What are the benefits of transparent communication in agile data science projects?","Type":1,"A":"Transparent communication, through regular meetings and documentation, helps keep team members informed and aligned with project goals, reducing misunderstandings.","B":"It is irrelevant, as individual team members should work independently without the need for collaboration or updates.","C":"It is to create unnecessary bureaucracy, slowing down the project by requiring excessive documentation and meetings.","D":"It is optional, and teams can achieve success without sharing information openly, fostering a more individualistic work culture.","True":"A","TopicID":1,"result":"D"},{"id":"6b02296b-df63-4d3c-a06b-17e9f4e5e431","Question":"Name one key emphasis of Lean in addition to continuous improvement.","Type":1,"A":"Respect for people is highlighted as a key emphasis of Lean in addition to static improvement","B":"Respect for Things is highlighted as a key emphasis of Keys in addition to continuous improvement","C":"Respect for people is highlighted as a key emphasis of Life in addition to continuous improvement","D":"Respect for people is highlighted as a key emphasis of Lean in addition to continuous improvement","True":"D","TopicID":1,"result":"C"},{"id":"500ecbc2-fe97-408e-8ad6-c38ea35b91fd","Question":"Which two principles does Lean prioritize for organizational efficiency?","Type":1,"A":"Lean prioritizes continuous improvement and respect for people for organizational efficiency.","B":"Lean prioritizes statics improvement and respect for people for organizational efficiency.","C":"Lean prioritizes continuous improvement and not respect for people for organizational efficiency.","D":"None","True":"A","TopicID":1,"result":"B"},{"id":"9ada10c4-8bf3-459f-b225-18282d3bb364","Question":"What role does rapid prototyping play in agile data science projects?","Type":1,"A":"it is merely a time-consuming process that delays project completion, as stakeholders have to wait for preliminary results before any progress can be made.","B":"it is to create a final, polished version of the solution, eliminating the need for further adjustments or iterations.","C":"it is an optional step and doesn't significantly contribute to the project's success, as stakeholders can understand the solution without visualizing preliminary results.","D":"it allows stakeholders to visualize and interact with preliminary results quickly, facilitating early validation and adjustments as needed.","True":"D","TopicID":1,"result":"D"},{"id":"346bc84e-69a4-454f-915e-2d7813f59e46","Question":"Where did Lean originate, and which manufacturing principles influenced its development?\r\nA: Lean originated from manufacturing principles developed by _____________________ .","Type":2,"A":"Hitach","B":"Suzuki","C":"Toyota","D":"Google","True":"C","TopicID":1,"result":"B"},{"id":"21470c3d-d32f-4fd0-a757-53d1b3c68d16","Question":"How does Lean aim to deliver value to customers?","Type":1,"A":"Lean aims to deliver customer value through efficient and streamlined processes.","B":"Lean aims to have customer value through not efficient and streamlined processes.","C":"Lean aims to take developers value through efficient and life processes.","D":"All","True":"A","TopicID":1,"result":"C"}]}]}